Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: In the :guilabel:`Reports` section, you can check the status of your site, tweak it for :ref:`production`, or manage SSH keys used to access :ref:`vcs-repos`.
sv: I avsnittet :guilabel:`Reports` kan du kontrollera statusen fÃ¶r din webbplats, justera den fÃ¶r :ref:`production` eller hantera SSH-nycklar som anvÃ¤nds fÃ¶r att komma Ã¥t :ref:`vcs-repos`.

source: Manage database objects under any of the sections. The most interesting one is probably :guilabel:`Weblate translations`, where you can manage translatable projects, see :ref:`project` and :ref:`component`.
sv: Hantera databasobjekt under valfri sektion. Den mest intressanta Ã¤r fÃ¶rmodligen :guilabel:`Weblate-Ã¶versÃ¤ttningar`, dÃ¤r du kan hantera Ã¶versÃ¤ttningsbara projekt, se :ref:`project` och :ref:`component`.

source: :guilabel:`Weblate languages` holds language definitions, explained further in :ref:`languages`.
sv: :guilabel:`Weblate-sprÃ¥k` innehÃ¥ller sprÃ¥kdefinitioner, som fÃ¶rklaras nÃ¤rmare i :ref:`languages`.

source: Adding a project
sv: LÃ¤gga till ett projekt

source: Adding a project serves as container for all components. Usually you create one project for one piece of software, or book (See :ref:`project` for info on individual parameters):
sv: Att lÃ¤gga till ett projekt fungerar som en behÃ¥llare fÃ¶r alla komponenter. Vanligtvis skapar man ett projekt fÃ¶r en mjukvara eller bok (se :ref:`project` fÃ¶r information om enskilda parametrar):

source: Bilingual components
sv: TvÃ¥sprÃ¥kiga komponenter

source: Once you have added a project, translation components can be added to it. (See :ref:`component` for info regarding individual parameters):
sv: NÃ¤r du har lagt till ett projekt kan Ã¶versÃ¤ttningskomponenter lÃ¤ggas till i det. (Se :ref:`component` fÃ¶r information om enskilda parametrar):

source: Monolingual components
sv: EnsprÃ¥kiga komponenter

source: For easier translation of these, provide a template file containing the mapping of message IDs to its respective source language (usually English). (See :ref:`component` for info regarding individual parameters):
sv: FÃ¶r att underlÃ¤tta Ã¶versÃ¤ttningen av dessa, tillhandahÃ¥ll en mallfil som innehÃ¥ller mappningen av meddelande-ID:n till respektive kÃ¤llsprÃ¥k (vanligtvis engelska). (Se :ref:`component` fÃ¶r information om enskilda parametrar):

source: In prior releases this feature was called whiteboard messages.
sv: I tidigare versioner hette den hÃ¤r funktionen whiteboard-meddelanden.

source: Provide info to your translators by posting announcements, site-wide, per project, component, or language.
sv: Ge information till dina Ã¶versÃ¤ttare genom att publicera meddelanden pÃ¥ hela webbplatsen, per projekt, komponent eller sprÃ¥k.

source: Announce the purpose, deadlines, status, or specify targets for translation.
sv: Meddela syftet, deadlines, status eller specificera mÃ¥l fÃ¶r Ã¶versÃ¤ttningen.

source: The users will receive notification on the announcements for watched projects (unless they opt out).
sv: AnvÃ¤ndarna kommer att fÃ¥ meddelanden om tillkÃ¤nnagivanden fÃ¶r bevakade projekt (om de inte vÃ¤ljer att avstÃ¥).

source: This can be useful for various things from announcing the purpose of the website to specifying targets for translations.
sv: Detta kan vara anvÃ¤ndbart fÃ¶r olika saker, frÃ¥n att tillkÃ¤nnage webbplatsens syfte till att ange mÃ¥l fÃ¶r Ã¶versÃ¤ttningar.

source: The announcements can posted on each level in the :guilabel:`Operations` menu, using :guilabel:`Post announcement`:
sv: Meddelandena kan publiceras pÃ¥ varje nivÃ¥ i menyn :guilabel:`Operations` med hjÃ¤lp av :guilabel:`Post announcement`:

source: Image showing an announcement that reads: "Translations will be used only if they reach 60%" atop the dashboard view.
sv: Bild som visar ett meddelande med texten: "ÃversÃ¤ttningar kommer endast att anvÃ¤ndas om de nÃ¥r 60 %" ovanfÃ¶r instrumentpanelen.

source: It can be also added using the admin interface:
sv: Det kan ocksÃ¥ lÃ¤ggas till via administratÃ¶rsgrÃ¤nssnittet:

source: The announcements are then shown based on their specified context:
sv: Meddelandena visas sedan utifrÃ¥n deras angivna sammanhang:

source: No context specified
sv: Inget sammanhang angivet

source: Shown on dashboard (landing page).
sv: Visas pÃ¥ instrumentpanelen (landningssida).

source: Project specified
sv: Projektet specificerades

source: Shown within the project, including all its components and translations.
sv: Visas inom projektet, inklusive alla dess komponenter och Ã¶versÃ¤ttningar.

source: Component specified
sv: Komponenten specificerades

source: Shown for a given component and all its translations.
sv: Visas fÃ¶r en given komponent och alla dess Ã¶versÃ¤ttningar.

source: Language specified
sv: SprÃ¥ket specificerades

source: Shown on the language overview and all translations in that language.
sv: Visas i sprÃ¥kÃ¶versikten och alla Ã¶versÃ¤ttningar pÃ¥ det sprÃ¥ket.

source: This is how it looks on the language overview page:
sv: SÃ¥ hÃ¤r ser det ut pÃ¥ sprÃ¥kÃ¶versiktssidan:

source: Image showing an announcement that reads: "Czech translators rock!" atop the Czech language overview.
sv: Bild som visar ett meddelande med texten: "Tjeckiska Ã¶versÃ¤ttare Ã¤r bÃ¤st!" ovanfÃ¶r Ã¶versikten Ã¶ver det tjeckiska sprÃ¥ket.

source: The default setup for Weblate is to use python-social-auth, a form on the website to handle registration of new users. After confirming their e-mail a new user can contribute or authenticate by using one of the third party services.
sv: StandardinstÃ¤llningen fÃ¶r Weblate Ã¤r att anvÃ¤nda python-social-auth, ett formulÃ¤r pÃ¥ webbplatsen fÃ¶r att hantera registrering av nya anvÃ¤ndare. Efter att ha bekrÃ¤ftat sin e-postadress kan en ny anvÃ¤ndare bidra eller autentisera sig genom att anvÃ¤nda en av tredjepartstjÃ¤nsterna.

source: You can also turn off registration of new users using :setting:`REGISTRATION_OPEN`.
sv: Du kan ocksÃ¥ inaktivera registrering av nya anvÃ¤ndare med :setting:`REGISTRATION_OPEN`.

source: The authentication attempts are subject to :ref:`rate-limit`.
sv: AutentiseringsfÃ¶rsÃ¶ken Ã¤r fÃ¶remÃ¥l fÃ¶r :ref:`rate-limit`.

source: Authentication backends
sv: Autentiseringsbackend

source: Weblate relies on Django for the authentication. This includes built-in password-based authentication, social authentication, and third-party authentication backends for Django.
sv: Weblate anvÃ¤nder Django fÃ¶r autentisering. Detta inkluderar inbyggd lÃ¶senordsbaserad autentisering, social autentisering och tredjepartsautentiseringsbackends fÃ¶r Django.

source: Using Django's built-in authentication means you can import the user database of other Django-based projects (see :ref:`pootle-migration`).
sv: Genom att anvÃ¤nda Djangos inbyggda autentisering kan du importera anvÃ¤ndardatabasen frÃ¥n andra Django-baserade projekt (se :ref:`pootle-migration`).

source: :ref:`docker-auth` describes how to configure authentication in the official Docker image.
sv: :ref:`docker-auth` beskriver hur man konfigurerar autentisering i den officiella Docker-bilden.

source: Social authentication
sv: Social autentisering

source: Thanks to :doc:`psa:index`, Weblate support authentication using many third party services such as GitLab, Ubuntu, Fedora, etc.
sv: Tack vare :doc:`psa:index` stÃ¶der Weblate autentisering med hjÃ¤lp av mÃ¥nga tredjepartstjÃ¤nster sÃ¥som GitLab, Ubuntu, Fedora etc.

source: Please check their documentation for generic configuration instructions in :doc:`psa:configuration/django`.
sv: Se deras dokumentation fÃ¶r generella konfigurationsinstruktioner i :doc:`psa:configuration/django`.

source: By default, Weblate relies on third-party authentication services to provide a validated e-mail address. If some of the services you want to use don't support this, please enforce e-mail validation on the Weblate side by configuring FORCE_EMAIL_VALIDATION for them. For example:
sv: Som standard fÃ¶rlitar sig Weblate pÃ¥ tredjepartsautentiseringstjÃ¤nster fÃ¶r att tillhandahÃ¥lla en validerad e-postadress. Om nÃ¥gra av de tjÃ¤nster du vill anvÃ¤nda inte stÃ¶der detta, vÃ¤nligen tvinga fram e-postvalidering pÃ¥ Weblate-sidan genom att konfigurera FORCE_EMAIL_VALIDATION fÃ¶r dem. Till exempel:

source: Enabling individual backends is quite easy, it's just a matter of adding an entry to the :setting:`django:AUTHENTICATION_BACKENDS` setting and possibly adding keys needed for a given authentication method. Please note that some backends do not provide user e-mail by default, you have to request it explicitly, otherwise Weblate will not be able to properly credit contributions users make.
sv: Det Ã¤r ganska enkelt att aktivera enskilda backends, det Ã¤r bara att lÃ¤gga till en post i instÃ¤llningen :setting:`django:AUTHENTICATION_BACKENDS` och eventuellt lÃ¤gga till nycklar som behÃ¶vs fÃ¶r en viss autentiseringsmetod. Observera att vissa backends inte tillhandahÃ¥ller anvÃ¤ndarens e-postadress som standard, du mÃ¥ste begÃ¤ra den uttryckligen, annars kommer Weblate inte att kunna kreditera anvÃ¤ndarnas bidrag pÃ¥ rÃ¤tt sÃ¤tt.

source: Most of the authentication backends require HTTPS. Once HTTPS is enabled in your web server please configure Weblate to report it properly using :setting:`ENABLE_HTTPS`, or by :envvar:`WEBLATE_ENABLE_HTTPS` in the Docker container.
sv: De flesta autentiseringsbackends krÃ¤ver HTTPS. NÃ¤r HTTPS har aktiverats pÃ¥ din webbserver ska du konfigurera Weblate sÃ¥ att det rapporteras korrekt med :setting:`ENABLE_HTTPS` eller med :envvar:`WEBLATE_ENABLE_HTTPS` i Docker-containern.

source: OpenID authentication
sv: OpenID-autentisering

source: For OpenID-based services it's usually just a matter of enabling them. The following section enables OpenID authentication for OpenSUSE, Fedora and Ubuntu:
sv: FÃ¶r OpenID-baserade tjÃ¤nster Ã¤r det vanligtvis bara en frÃ¥ga om att aktivera dem. FÃ¶ljande avsnitt aktiverar OpenID-autentisering fÃ¶r OpenSUSE, Fedora och Ubuntu:

source: GitHub authentication
sv: GitHub-autentisering

source: You need to register an OAuth application on GitHub and then tell Weblate all its secrets:
sv: Du mÃ¥ste registrera en OAuth-applikation pÃ¥ GitHub och sedan uppge alla dess hemligheter fÃ¶r Weblate:

source: The GitHub should be configured to have callback URL as ``https://WEBLATE SERVER/accounts/complete/github/``.
sv: GitHub bÃ¶r konfigureras sÃ¥ att den har Ã¥teruppringnings-URL:en ``https://WEBLATE SERVER/accounts/complete/github/``.

source: There are similar authentication backends for GitHub for Organizations and GitHub for Teams. Their settings are named ``SOCIAL_AUTH_GITHUB_ORG_*`` and ``SOCIAL_AUTH_GITHUB_TEAM_*``, and they require additional setting of the scope - ``SOCIAL_AUTH_GITHUB_ORG_NAME`` or ``SOCIAL_AUTH_GITHUB_TEAM_ID``. Their callback URLs are ``https://WEBLATE SERVER/accounts/complete/github-org/`` and ``https://WEBLATE SERVER/accounts/complete/github-teams/``.
sv: Det finns liknande autentiseringsbackends fÃ¶r GitHub for Organizations och GitHub for Teams. Deras instÃ¤llningar heter ``SOCIAL_AUTH_GITHUB_ORG_*`` och ``SOCIAL_AUTH_GITHUB_TEAM_*``, och de krÃ¤ver ytterligare instÃ¤llningar av omfattningen - ``SOCIAL_AUTH_GITHUB_ORG_NAME`` eller ``SOCIAL_AUTH_GITHUB_TEAM_ID``. Deras Ã¥teruppringnings-URL:er Ã¤r ``https://WEBLATE SERVER/accounts/complete/github-org/`` och ``https://WEBLATE SERVER/accounts/complete/github-teams/``.

source: Weblate provided callback URL during the authentication includes configured domain. In case you get errors about URL mismatch, you might want to fix this, see :ref:`production-site`.
sv: Weblate tillhandahÃ¶ll Ã¥teruppringnings-URL under autentiseringen inkluderar konfigurerad domÃ¤n. Om du fÃ¥r felmeddelanden om att URL inte stÃ¤mmer Ã¶verens kan du Ã¥tgÃ¤rda detta, se :ref:`production-site`.

source: GitHub EE authentication
sv: GitHub EE-autentisering

source: You need to register an OAuth App on GitHub EE and then tell Weblate all its secrets:
sv: Du mÃ¥ste registrera en OAuth-app pÃ¥ GitHub EE och sedan ange alla dess hemligheter i Weblate:

source: The GitHub OAuth App should be configured to have callback URL as ``https://WEBLATE SERVER/accounts/complete/github-enterprise/``.
sv: GitHub OAuth-appen ska konfigureras sÃ¥ att den har Ã¥terkopplings-URL:en ``https://WEBLATE SERVER/accounts/complete/github-enterprise/``.

source: Instead GitHub OAuth App, GitHub App can also be used. With GitHub App permissions can be granted on repositories, organisation and/or user level. If you decide to use GitHub App, you need to enable `Access: Read-only` permission for Users - <Email addresses> and Organisation - <Members>.
sv: IstÃ¤llet fÃ¶r GitHub OAuth App kan Ã¤ven GitHub App anvÃ¤ndas. Med GitHub App kan behÃ¶righeter beviljas pÃ¥ repositorier, organisations- och/eller anvÃ¤ndarnivÃ¥. Om du vÃ¤ljer att anvÃ¤nda GitHub App mÃ¥ste du aktivera behÃ¶righeten `Access: Read-only` fÃ¶r anvÃ¤ndare - <Email addresses> och organisation - <Members>.

source: Bitbucket authentication
sv: Bitbucket-autentisering

source: You need to register an application on Bitbucket and then tell Weblate all its secrets:
sv: Du mÃ¥ste registrera en applikation pÃ¥ Bitbucket och sedan berÃ¤tta alla dess hemligheter fÃ¶r Weblate:

source: To use Google OAuth 2, you need to register an OAuth application at <https://console.developers.google.com/>.
sv: FÃ¶r att kunna anvÃ¤nda Google OAuth 2 mÃ¥ste du registrera en OAuth-applikation pÃ¥ <https://console.developers.google.com/>.

source: The redirect URL is ``https://WEBLATE SERVER/accounts/complete/google-oauth2/``.
sv: Omdirigeringsadressen Ã¤r ``https://WEBLATE SERVER/accounts/complete/google-oauth2/``.

source: As per usual with OAuth 2 services, you need to register your application with Facebook. Once this is done, you can set up Weblate to use it:
sv: Som vanligt med OAuth 2-tjÃ¤nster mÃ¥ste du registrera din applikation hos Facebook. NÃ¤r detta Ã¤r gjort kan du konfigurera Weblate fÃ¶r att anvÃ¤nda den:

source: The redirect URL is ``https://WEBLATE SERVER/accounts/complete/facebook/``.
sv: Omdirigeringsadressen Ã¤r ``https://WEBLATE SERVER/accounts/complete/facebook/``.

source: For using GitLab OAuth 2, you need to register an application at <https://gitlab.com/profile/applications>.
sv: FÃ¶r att kunna anvÃ¤nda GitLab OAuth 2 mÃ¥ste du registrera en applikation pÃ¥ <https://gitlab.com/profile/applications>.

source: The redirect URL is ``https://WEBLATE SERVER/accounts/complete/gitlab/`` and ensure you mark the `read_user` scope.
sv: Omdirigeringsadressen Ã¤r ``https://WEBLATE SERVER/accounts/complete/gitlab/`` och se till att du markerar `read_user`-omfÃ¥nget.

source: For using Gitea OAuth 2, you need to register an application at ``https://GITEA SERVER/user/settings/applications``.
sv: FÃ¶r att kunna anvÃ¤nda Gitea OAuth 2 mÃ¥ste du registrera en applikation pÃ¥ ``https://GITEA SERVER/user/settings/applications``.

source: The redirect URL is ``https://WEBLATE SERVER/accounts/complete/gitea/``.
sv: Omdirigeringsadressen Ã¤r ``https://WEBLATE SERVER/accounts/complete/gitea/``.

source: The configuration above also works with Forgejo; for an example of production deployment with Forgejo, see `Codeberg Translate <https://translate.codeberg.org>`_.
sv: Konfigurationen ovan fungerar Ã¤ven med Forgejo. FÃ¶r ett exempel pÃ¥ produktionsdistribution med Forgejo, se `Codeberg Translate <https://translate.codeberg.org>`_.

source: Weblate can be configured to use common or specific tenants for authentication.
sv: Weblate kan konfigureras fÃ¶r att anvÃ¤nda allmÃ¤nna eller specifika anvÃ¤ndare fÃ¶r autentisering.

source: The redirect URL is ``https://WEBLATE SERVER/accounts/complete/azuread-oauth2/`` for common and ``https://WEBLATE SERVER/accounts/complete/azuread-tenant-oauth2/`` for tenant-specific authentication.
sv: Omdirigerings-URL:en Ã¤r ``https://WEBLATE SERVER/accounts/complete/azuread-oauth2/`` fÃ¶r allmÃ¤n autentisering och ``https://WEBLATE SERVER/accounts/complete/azuread-tenant-oauth2/`` fÃ¶r hyresgÃ¤stspecifik autentisering.

source: You will need following:
sv: Du behÃ¶ver fÃ¶ljande:

source: *Application (client) ID* can be obtained from application page. *Object ID* is not used in Weblate.
sv: *Applikations-ID (klient-ID)* kan hÃ¤mtas frÃ¥n applikationssidan. *Objekt-ID* anvÃ¤nds inte i Weblate.

source: *Directory (tenant) ID* is needed for tenant scoped authentication, what is usually desired.
sv: *Katalog-ID (tenant) ID* behÃ¶vs fÃ¶r autentisering inom tenant-ramen, vilket vanligtvis Ã¤r Ã¶nskvÃ¤rt.

source: *Secret value* is displayed once you generate a secret for an application. *Secret ID* is not used in Weblate.
sv: *Hemligt vÃ¤rde* visas nÃ¤r du genererar en hemlighet fÃ¶r en applikation. *Hemligt ID* anvÃ¤nds inte i Weblate.

source: For using Slack OAuth 2, you need to register an application at <https://api.slack.com/apps>.
sv: FÃ¶r att kunna anvÃ¤nda Slack OAuth 2 mÃ¥ste du registrera en applikation pÃ¥ <https://api.slack.com/apps>.

source: The redirect URL is ``https://WEBLATE SERVER/accounts/complete/slack/``.
sv: Omdirigeringsadressen Ã¤r ``https://WEBLATE SERVER/accounts/complete/slack/``.

source: Overriding authentication method names and icons
sv: Ãverordnade autentiseringsmetoder och ikoner

source: You can override the authentication method display name and icon using using settings as ``SOCIAL_AUTH_<NAME>_IMAGE`` and ``SOCIAL_AUTH_<NAME>_TITLE``. For example overriding naming for Auth0 would look like:
sv: Du kan Ã¥sidosÃ¤tta visningsnamnet och ikonen fÃ¶r autentiseringsmetoden med hjÃ¤lp av instÃ¤llningarna ``SOCIAL_AUTH_<NAME>_IMAGE`` och ``SOCIAL_AUTH_<NAME>_TITLE``. Ett exempel pÃ¥ Ã¥sidosÃ¤ttande av namngivning fÃ¶r Auth0 skulle se ut sÃ¥ hÃ¤r:

source: Turning off password authentication
sv: Inaktivera lÃ¶senordsautentisering

source: E-mail and password authentication can be turned off by removing ``social_core.backends.email.EmailAuth`` from :setting:`django:AUTHENTICATION_BACKENDS`. Always keep ``weblate.accounts.auth.WeblateUserBackend`` there, it is needed for core Weblate functionality.
sv: E-post- och lÃ¶senordsautentisering kan inaktiveras genom att ta bort ``social_core.backends.email.EmailAuth`` frÃ¥n :setting:`django:AUTHENTICATION_BACKENDS`. BehÃ¥ll alltid ``weblate.accounts.auth.WeblateUserBackend`` dÃ¤r, det behÃ¶vs fÃ¶r Weblates kÃ¤rnfunktioner.

source: Disabling e-mail authentication will disable all e-mail related functionality â user invitation or password reset feature.
sv: Om du inaktiverar e-postautentisering inaktiveras alla e-postrelaterade funktioner â anvÃ¤ndarinbjudningar och Ã¥terstÃ¤llning av lÃ¶senord.

source: You can still use password authentication for the admin interface, for users you manually create there. Just navigate to ``/admin/login/``.
sv: Du kan fortfarande anvÃ¤nda lÃ¶senordsautentisering fÃ¶r administratÃ¶rsgrÃ¤nssnittet fÃ¶r anvÃ¤ndare som du skapar manuellt dÃ¤r. GÃ¥ bara till ``/admin/login/``.

source: For example authentication using only the openSUSE Open ID provider can be achieved using the following:
sv: Autentisering med endast openSUSE Open ID-leverantÃ¶ren kan till exempel uppnÃ¥s med fÃ¶ljande:

source: Password authentication
sv: Lösenordsautentisering

source: The default :file:`settings.py` comes with a reasonable set of :setting:`django:AUTH_PASSWORD_VALIDATORS` that ensures that weak passwords are not allowed. You can customize this setting to match your password policy.
sv: Standardfilen :file:`settings.py` innehÃ¥ller en rimlig uppsÃ¤ttning :setting:`django:AUTH_PASSWORD_VALIDATORS` som sÃ¤kerstÃ¤ller att svaga lÃ¶senord inte tillÃ¥ts. Du kan anpassa denna instÃ¤llning sÃ¥ att den Ã¶verensstÃ¤mmer med din lÃ¶senordspolicy.

source: Additionally you can also install `django-zxcvbn-password-validator <https://github.com/Pierre-Sassoulas/django-zxcvbn-password-validator>`_ which gives quite realistic estimates of password difficulty and allows rejecting passwords below a certain threshold.
sv: Dessutom kan du ocksÃ¥ installera `django-zxcvbn-password-validator <https://github.com/Pierre-Sassoulas/django-zxcvbn-password-validator>`_ som ger ganska realistiska uppskattningar av lÃ¶senordets svÃ¥righetsgrad och gÃ¶r det mÃ¶jligt att avvisa lÃ¶senord som ligger under en viss trÃ¶skel.

source: SAML authentication
sv: SAML-autentisering

source: The dependencies for SAML authentication are no longer included in the default ``all`` extras. You need to include ``saml`` while installing the Weblate package using pip (``uv pip install Weblate[all,saml]``).
sv: Beroendena fÃ¶r SAML-autentisering ingÃ¥r inte lÃ¤ngre i standardtillÃ¤ggen ``all``. Du mÃ¥ste inkludera ``saml`` nÃ¤r du installerar Weblate-paketet med pip (``uv pip install Weblate[all,saml]``).

source: Please follow the Python Social Auth instructions for configuration. Notable differences:
sv: FÃ¶lj instruktionerna fÃ¶r Python Social Auth fÃ¶r konfiguration. Viktiga skillnader:

source: Weblate supports single IDP which has to be called ``weblate`` in ``SOCIAL_AUTH_SAML_ENABLED_IDPS``.
sv: Weblate stÃ¶der en enda IDP som mÃ¥ste kallas ``weblate`` i ``SOCIAL_AUTH_SAML_ENABLED_IDPS``.

source: The SAML XML metadata URL is ``/accounts/metadata/saml/``, which is also an entity ID.
sv: SAML XML-metadata-URL:en Ã¤r ``/accounts/metadata/saml/``, vilket ocksÃ¥ Ã¤r ett entitets-ID.

source: The sign-in URL is ``/accounts/complete/saml/`` (also known as ACS URL).
sv: Inloggningsadressen Ã¤r ``/accounts/complete/saml/`` (Ã¤ven kÃ¤nd som ACS-adress).

source: Following settings are automatically filled in: ``SOCIAL_AUTH_SAML_SP_ENTITY_ID``, ``SOCIAL_AUTH_SAML_TECHNICAL_CONTACT``, ``SOCIAL_AUTH_SAML_SUPPORT_CONTACT``
sv: FÃ¶ljande instÃ¤llningar fylls i automatiskt: ``SOCIAL_AUTH_SAML_SP_ENTITY_ID``, ``SOCIAL_AUTH_SAML_TECHNICAL_CONTACT``, ``SOCIAL_AUTH_SAML_SUPPORT_CONTACT``

source: Example configuration:
sv: Exempel pÃ¥ konfiguration:

source: The default configuration extracts user details from following attributes, configure your IdP to provide them:
sv: Standardkonfigurationen extraherar anvÃ¤ndarinformation frÃ¥n fÃ¶ljande attribut. Konfigurera din IdP sÃ¥ att den tillhandahÃ¥ller dessa:

source: SAML URI reference
sv: SAML URI-referens

source: First name
sv: FÃ¶rnamn

source: Last name
sv: Efternamn

source: When configuring Weblate SP in your IdP, it is recommended to choose persistent :guilabel:`Name ID format`.
sv: NÃ¤r du konfigurerar Weblate SP i din IdP rekommenderas det att vÃ¤lja persistent :guilabel:`Namn-ID-format`.

source: The example above and the Docker image define an IdP called ``weblate``. You might need to configure this string as :guilabel:`Relay` in your IdP.
sv: Exemplet ovan och Docker-bilden definierar en IdP som heter ``weblate``. Du kan behÃ¶va konfigurera denna strÃ¤ng som :guilabel:`Relay` i din IdP.

source: Weblate authentication relies on the ``RelayState`` parameter to be passed through the authentication process. This needs to be configured with some identity providers:
sv: Weblate-autentisering Ã¤r beroende av att parametern ``RelayState`` skickas genom autentiseringsprocessen. Detta mÃ¥ste konfigureras med vissa identitetsleverantÃ¶rer:

source: `How to Send a Custom RelayState with Okta`_
sv: `Hur man skickar ett anpassat RelayState med Okta`_

source: :ref:`Configuring SAML in Docker <docker-saml>`
sv: :ref:`Konfigurera SAML i Docker <docker-saml>`

source: LDAP authentication
sv: Autentisering med LDAP

source: LDAP authentication can be best achieved using the `django-auth-ldap` package. You can install it via usual means:
sv: LDAP-autentisering kan bÃ¤st uppnÃ¥s med hjÃ¤lp av paketet `django-auth-ldap`. Du kan installera det pÃ¥ vanligt sÃ¤tt:

source: This package is included in the Docker container, see :doc:`/admin/install/docker`.
sv: Detta paket ingÃ¥r i Docker-containern, se :doc:`/admin/install/docker`.
